package HomeTask5.Task2;

/*
Написати структуру Банк :
Створити клас Account, від нього унаслідувати різні типи акаунтів : DebitAccount(в нього поле Id є стрінговим),
 CreditAccount(в нього поле Id є числовим).
Створити клас User.
Створити параметризований інтерфейс - User service, який буде в якості параметрі приймати Account(та наслідників)
та User і буде мати наступні методи :

показати всіх користувачів(посортованих по user name)
показати всі рахунки
повернути кількість податку для людини, яка розраховується як загальну суму на рахунку * 0,05
 */
public class Account<T> {
    T id;
    Double sum;

    public Account(T id, Double sum) {
        this.id = id;
        this.sum = sum;
    }


}
